herolizhen/YJIOT/FW/L506/stm32f103c8t6-l506/stm32f103c8t6-l506-https/user/user_L506/L506.c
#include "stdint.h"
#include "stdio.h"
#include "string.h"
#include "stdlib.h"
#include "ucos_ii.h" 
#include "stm32f10x.h"
#include "L506.h"
#include "user_L506_task.h"
#include "charge.h"
#include "malloc.h"
#include "app.h"
#include "cJSON.h"

//extern OS_EVENT *upload_data_queue;
extern OS_EVENT *mqtt_message_queue;

extern Charge_Typedef charge_info;

extern OS_EVENT *upload_data_queue;
extern OS_EVENT *upload_res_queue;

extern OS_EVENT *mqtt_action_cmd_queue;
extern OS_EVENT *mqtt_action_res_queue;

extern OS_EVENT *upload_data_mutex;
extern OS_EVENT *mqtt_cmd_mutex;


char token_buff[TOKEN_BUFF_SIZE];
char order_num[41];
char ccid[40];
uint8_t is_disabled_cmd_echo = 0;
uint8_t Is_Get_CCID = 0;
char device_id[40];
//bit Is_Get_IMEI = 0;
uint8_t Is_device_activate = 0;
uint8_t is_get_token = 0;
uint8_t is_need_updata_token = 0;
uint8_t Is_L506_wakeup = 0;

uint8_t is_ota_check = 0;

static uint8_t https_step = 0;

uint8_t L506_action = 0;

//如果mqtt_action = 0，则没有mqtt动作
static uint8_t mqtt_action = 0;
static uint8_t is_mqtt_inited = 0;
//static uint8_t mqtt_connect_status = 0;
static uint8_t mqtt_init_step = 0;
uint16_t mqtt_passowrd = 0;

//L506启动后和服务器通讯的初始化工作是否结束
uint8_t is_L506_fogcloud_init = 0;

//信号质量
uint32_t signal_quality = 0;
//读取信号质量时，检测误码率是否是0
uint8_t Is_signal_err_code_zero = 0;



uint8_t Is_signal_check;
uint8_t signal_check_err_times;



uint8_t wifi_led_state;



static https_requeset_res_t https_req_res;
static mqtt_action_res_t mqtt_action_res;

static uint32_t http_session_id = 0;



//AT指令发送时间
L506_Cmd_Typedef L506_cmd_info;

L506_RESGISTER_Typedef L506_register_net;


//L506与服务器http通讯第几步标识
static uint8_t Is_http = 0;

static uint32_t save_http_session_id(uint32_t id)
{
    http_session_id = id;

    return id;
}

static uint32_t get_http_session_id(void)
{
    return http_session_id;
}


//电源芯片控制管脚低电平时，电源芯片工作

void L506_Reset_Pin_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruchture;
	
    RCC_APB2PeriphClockCmd(L506_RESET_GPIO_CLK, ENABLE);
	
    GPIO_InitStruchture.GPIO_Pin = L506_RESET_PIN;
    GPIO_InitStruchture.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStruchture.GPIO_Speed = GPIO_Speed_50MHz;
	
    GPIO_Init(L506_RESET_PORT, &GPIO_InitStruchture);
  
    POWER_KEY_HIGH();
}

void L506_Reset_Pin_High(void)
{
    L506_RESET_HIGH();
}

void L506_Reset_Pin_Low(void)
{
    L506_RESET_LOW();    
}

void L506_Reset(void)
{
    L506_Reset_Pin_Low();
    OSTimeDlyHMSM(0,0,1,0); 
    L506_Reset_Pin_High();  

    is_disabled_cmd_echo = 0;
    https_step = 0;
    Is_http = 0;
    L506_action = 0;
    
    signal_quality = 99;
    Is_Get_CCID = 0;
    Is_signal_err_code_zero = 0;
    Is_device_activate = 0;
    is_get_token = 0;
    L506_register_net.Is_L506_registerd = 0;
        
    L506_cmd_info.error_times = 0;
    L506_cmd_info.timeout_times = 0;
    
    
    is_ota_check = 0;
    is_L506_fogcloud_init = 0;
    is_mqtt_inited = 0;
    mqtt_init_step = 0;
    
    
    L506_LOG("L506 reset");  
}


//开机：PWK管脚高电平脉冲，然后低电平保持500ms,然后再高电平开机
//关机：PWK管脚高电平脉冲，然后低电平保持3s,然后再高电平关机
void L506_PowerKey_Pin_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruchture;
	
    RCC_APB2PeriphClockCmd(POWER_KEY_GPIO_CLK, ENABLE);
	
    GPIO_InitStruchture.GPIO_Pin = POWER_KEY_PIN;
    GPIO_InitStruchture.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStruchture.GPIO_Speed = GPIO_Speed_50MHz;
	
    GPIO_Init(POWER_KEY_PORT, &GPIO_InitStruchture);
  
    POWER_KEY_HIGH();
}

//开机：PWK管脚高电平脉冲，然后低电平保持500ms,然后再高电平开机
void L506_PowerKey_On(void)
{  
    POWER_KEY_HIGH();
    OSTimeDlyHMSM(0,0,0,500);
    POWER_KEY_LOW();
    OSTimeDlyHMSM(0,0,0,500);
    POWER_KEY_HIGH();
}

//关机：PWK管脚高电平脉冲，然后低电平保持3s,然后再高电平关机
void L506_PowerKey_Off(void)
{
    POWER_KEY_HIGH();
    OSTimeDlyHMSM(0,0,0,500);
    POWER_KEY_LOW();
    OSTimeDlyHMSM(0,0,2,500);
    POWER_KEY_HIGH();
    OSTimeDlyHMSM(0,0,6,0);
}

void L506_Restart(void)
{
    //重启L506 
    L506_PowerKey_Off();  
    L506_PowerKey_On();
        
    is_disabled_cmd_echo = 0;
    https_step = 0;
    Is_http = 0;
    L506_action = 0;
    
    signal_quality = 99;
    Is_Get_CCID = 0;
    Is_signal_err_code_zero = 0;
    Is_device_activate = 0;
    is_get_token = 0;
    L506_register_net.Is_L506_registerd = 0;
        
    L506_cmd_info.error_times = 0;
    L506_cmd_info.timeout_times = 0;
    
    
    is_ota_check = 0;
    is_L506_fogcloud_init = 0;
    is_mqtt_inited = 0;
    mqtt_init_step = 0;
    
    
    L506_LOG("L506 restart");
    
}


int L506_wait_response(char *rx_buff,uint16_t *index)
{
    int res = L506_WAIT_RESPONSE;
  
    uint32_t nowtime_ms = 0;
    
  
    if(L506_register_net.Is_L506_registerd == 0)
    {
        if(strstr(rx_buff,L506_READY) != NULL)
        {
            L506_register_net.Is_L506_registerd = 1;
            empty_rx_buff(rx_buff,index);
          
            L506_LOG("L506 ready");
            OSTimeDlyHMSM(0,0,5,0);
        }
        //是否加一些处理
    }
    
  
    //如果之前没有发送过数据或者命令，则直接返回
    if(L506_cmd_info.Is_wait_data == 0)
    {
        res = CMD_IDLE;
        L506_cmd_info.cmd_result = CMD_IDLE;
        goto exit;
    }
    
    nowtime_ms = OSTimeGet();
    
    
    //防止时间溢出
    if(L506_cmd_info.cmd_send_time > 0xF0000000 && nowtime_ms < 0xE0000000)
    {
        L506_cmd_info.cmd_send_time = nowtime_ms;
    }

    
    //超时 没有返回数据
    if(nowtime_ms >= (L506_cmd_info.cmd_send_time + L506_CMD_TIMEOUT_TIME))
    {
        L506_cmd_info.cmd_result = CMD_TIMEOUT;
      
        L506_LOG("cmd:%s timeout",L506_cmd_info.cmd);
              
        res = CMD_TIMEOUT;
        goto cmd_failed;
    }
    
    if(strstr(rx_buff,END_ERROR) != NULL)
    {
        L506_cmd_info.cmd_result = CMD_ERROR;
      
        if(L506_cmd_info.type == CMD_TYPE)
        {
            L506_LOG("cmd:%s error",L506_cmd_info.cmd);         
        }
        else
        {
            L506_LOG("send string error");
        }

      
        res = CMD_ERROR;
        goto cmd_failed;
    }
    
    if(L506_cmd_info.type == STRING_TYPE)
    {
        //发送字符串时返回OK或者ERROR
        if(strstr(rx_buff,L506_cmd_info.end_flag) != NULL)
        {
            L506_cmd_info.cmd_result = CMD_SUCCESS;   
            res = CMD_SUCCESS; 
            goto  cmd_success;       
        }
        
        if(Is_http == 1)
        {
            //https_step += 1;
            L506_cmd_info.cmd_result = CMD_SUCCESS;   
            goto  cmd_success;       
        }
      
