herolizhen/YJIOT/FW/L506/stm32f103c8t6-l506/stm32f103c8t6-l506-https/user/user_L506/L506.c
    }
    else if(L506_cmd_info.type == CMD_TYPE)
    {
        
        //发送命令时会返回命令+OK或者命令+ERROR或者>>
        if(strstr(rx_buff,L506_cmd_info.end_flag) != NULL)
        {            
            res = CMD_SUCCESS;
            L506_cmd_info.cmd_result = CMD_SUCCESS;   

            L506_LOG("cmd:%s success",L506_cmd_info.cmd);
        
            goto cmd_success;
        }

        
    }
    

exit:    
    return res;
    
cmd_success:
    //L506_cmd_info.cmd_result = CMD_SUCCESS;
    return res;
    
    
cmd_failed:
    //L506_cmd_info.cmd_result = res;
    return res;
    
}


void parse_L506_cmd_result(char *rx_buff,uint16_t *index)
{  
    INT8U err;  
    char *pos,*pos_end = NULL;
    char *http_body_start_pos,*http_body_end_pos = NULL;
    uint16_t http_body_length = 0;
    unsigned char ordnum_cmp_result = 0;
    int res_code = -1;
    int http_code = 0;
    unsigned char i = 0;
    upload_res_t *temp_msg;
    char *buff = NULL;
    //uint8_t mqtt_conncet_status = 0;
    
    
    if(L506_cmd_info.Is_wait_data == 0)
    {
        return;
    }
    else if(L506_cmd_info.Is_wait_data == 1)
    {
        if(L506_cmd_info.cmd_result == CMD_WAIT)
        {
            return;
        }
        else if(L506_cmd_info.cmd_result == CMD_SUCCESS)
        {
         
            L506_cmd_info.Is_wait_data = 0;
          
            if(L506_cmd_info.type == STRING_TYPE)
            {
                https_step += 1;
                return;
            }
                        
          
            if(strcmp(L506_cmd_info.cmd,L506_ATI_CMD) == 0)
            {
            
            }
            else if(strcmp(L506_cmd_info.cmd,L506_DISABLE_CMD_ECHO_CMD) == 0)
            {
                is_disabled_cmd_echo = 1;
            }
            else if(strcmp(L506_cmd_info.cmd,L506_CSQ_CMD) == 0)
            {
                //获取信号质量
                //debug
                L506_LOG("%s",rx_buff);
              
                pos = strstr(rx_buff,":");
                if(pos != NULL)
                {                   
                    if(*(pos + 3) == ASCII_COMMA)
                    {
                        i = 1;
                    }
                    if(*(pos + 4) == ASCII_COMMA)
                    {
                        i = 2;
                    }
                    
                    if(i == 0)
                    {
                        return;
                    }
                                        
                    memset(L506_cmd_info.sendtring,0,strlen(L506_cmd_info.sendtring));
                    strncpy(L506_cmd_info.sendtring,(pos + 2),i);
                    signal_quality = atoi(L506_cmd_info.sendtring);
                    
                    L506_LOG("signal_quality = %d",signal_quality);
                }              
            }
            else if(strcmp(L506_cmd_info.cmd,L506_GSN_CMD) == 0)
            {
                //获取IMEI成功
              
                //Is_Get_IMEI = 1;
            }
            else if(strcmp(L506_cmd_info.cmd,L506_CICCID_CMD) == 0)
            {
                //获取CCID成功
                memset(ccid,0,sizeof(ccid));
                pos = strstr(rx_buff,L506_CICCID_RES);
                strncpy(ccid,pos + strlen(L506_CICCID_RES) + 1,L506_CCID_LEN);
              
                L506_LOG("CCID:%s",ccid);
              
                Is_Get_CCID = 1;
            }            
            else if(strcmp(L506_cmd_info.cmd,L506_QSPN_CMD) == 0)
            {     
                //读取SIM 卡服务运营商名称             
                //printf("L506_QSPN_CMD OK\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPS_START_CMD) == 0)
            {                        
                //printf("L506_HTTPS_START_CMD OK\r\n");
              
                https_step += 1;
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSPOSE_CMD) == 0)
            {                       
                //printf("L506_HTTPSPOSE_CMD OK\r\n");
              
                https_step += 1;
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSSEND_NZ_CMD) == 0)
            {                       
                //printf("L506_HTTPSSEND_CMD OK\r\n");
              
                https_step += 1;
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPS_SEND_REQUEST_CMD) == 0)
            {                       
                //printf("send https request success\r\n");
              
                https_step += 1;
                //OSTimeDlyHMSM(0,0,0,10); 
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSSEND_Z_CMD) == 0)
            {                       
                //printf("L506_HTTPSSEND_CMD OK\r\n");              
                https_step += 1;             
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSRECV_CMD) == 0)
            { 
                L506_cmd_info.error_times = 0;
                L506_cmd_info.timeout_times = 0;   
              
                L506_LOG("%s",rx_buff);
                            
                //set http send data length 
                if(https_step < HTTPS_MAX_STEP)
                {
                    https_step += 1;
                }
                
                if(is_queue_full(upload_res_queue) == QUEUE_FULL)
                {
                    //消息队列满了，push一个出来
                    L506_LOG("upload data queue full,push one msg");
                    temp_msg = OSQPend(upload_res_queue,10,&err);
                    if(err != OS_ERR_NONE)
                    {
                        //res = UPLAOD_RES_QUEUE_ERR;
                        return;
                    }
        
                    //push出来的消息队列必须要释放掉内存空间
                    if(temp_msg->http_body != NULL)
                    {
                        myfree(temp_msg->http_body);
                        temp_msg->http_body = NULL;
                    }

                }
                
                if((pos = strstr(rx_buff,"code")) != NULL)
                {
                    res_code = string_get_int(pos);
                    https_req_res.upload_res.http_id = res_code;
                }
                else
                {
                    L506_LOG("not find code key");
                    //如果没有code，则服务器回复的数据有问题,立刻给 upload_res_queue 消息队列push一个错误的msg,让函数返回
                    https_req_res.upload_res.http_id = 0;
                    goto push_res_msg;
                    
