herolizhen/YJIOT/FW/L506/stm32f103c8t6-l506/stm32f103c8t6-l506-https/user/user_L506/L506.c
                }
                
                //printf("return code:%d\r\n",res_code);
              
                if(res_code == TOKEN_WRONG_CODE)
                {
                    is_need_updata_token = 1;
                    L506_LOG("token expired");
                }
                
                pos = strstr(rx_buff,HTTPS_RES_START_FLAG);
                if(pos == NULL)
                {
                    https_req_res.upload_res.http_id = 0;
                    goto push_res_msg;
                }
                pos = pos + strlen(HTTPS_RES_START_FLAG);
                for(i = 0;i < 10;i++)
                {
                    if(*(pos + i) == '\r')
                    {
                        break;
                    }
                }
                    
                if(i == 10)
                {
                    https_req_res.upload_res.http_id = 0;
                    //服务器回复的数据有问题,立刻给 upload_res_queue 消息队列push一个错误的msg,让函数返回
                    goto push_res_msg;
                }
                    
                buff = mymalloc(10);
                if(buff == NULL)
                {
                    https_req_res.upload_res.http_id = 0;
                    //服务器回复的数据有问题,立刻给 upload_res_queue 消息队列push一个错误的msg,让函数返回
                    goto push_res_msg;
                }
                memset(buff,0,10);
                    
                strncpy(buff,pos,i);
                http_code = (uint8_t)atoi(buff);
                myfree(buff);
                buff = NULL;
                
                if(http_code != HTTPS_RES_OK)
                {
                    //如果返回的http头 code不等于200，则与服务器通讯错误
                    https_req_res.upload_res.http_id = 0;
                    goto push_res_msg;
                }
                
                
                //get http body
                pos = strstr(rx_buff,HTTPS_RES_BODY_START_FLAG);
                if(pos == NULL)
                {
                    https_req_res.upload_res.http_id = 0;
                    goto push_res_msg;
                }
                
                http_body_start_pos = pos + strlen(HTTPS_RES_BODY_START_FLAG) - 1;
                    
                http_body_end_pos = strstr(rx_buff,HTTPS_RES_BODY_STOP_FLAG);
                if(http_body_end_pos == NULL)
                {
                    https_req_res.upload_res.http_id = 0;
                    goto push_res_msg;
                }
                http_body_end_pos -= 3;
                
                if(*http_body_start_pos != '{' && *http_body_end_pos != '}')
                {
                    https_req_res.upload_res.http_id = 0;
                    goto push_res_msg;
                }
                //printf("malloc res http_body\r\n");
                https_req_res.upload_res.http_body = mymalloc(HTTP_RES_BODY_LENGTH);
                if(https_req_res.upload_res.http_body == NULL)
                {
                    https_req_res.upload_res.http_id = 0;
                    goto push_res_msg;
                }
                
                http_body_length = http_body_end_pos - http_body_start_pos + 1;
                if(http_body_length >= (HTTP_RES_BODY_LENGTH -1))
                {
                    https_req_res.upload_res.http_id = 0;
                    goto push_res_msg;
                }
                
                memset(https_req_res.upload_res.http_body,0,HTTP_RES_BODY_LENGTH);
                strncpy(https_req_res.upload_res.http_body,http_body_start_pos,http_body_length);
                
                
                
                push_res_msg:  
                  
                
                https_req_res.upload_res.code = http_code;
                https_req_res.upload_res.http_id = get_http_session_id();
                  
                err = OSQPost(upload_res_queue,&https_req_res.upload_res);
                if(err != OS_ERR_NONE)
                {
                    L506_LOG("push upload data msg error");
                    if(https_req_res.upload_res.http_body != NULL)
                    {
                        myfree(https_req_res.upload_res.http_body);
                        https_req_res.upload_res.http_body = NULL;
                    }
                    //res = UPLAOD_REQ_QUEUE_ERR;
                }
                
                
           
            
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSCLOSE_CMD) == 0)
            {
                https_step += 1;
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSSTOP_CMD) == 0)
            {
                L506_cmd_info.Is_wait_data = 0;
                https_step = 0;
                Is_http = 0;
                L506_action = 0;
            }
            
            else if(strcmp(L506_cmd_info.cmd,L506_MQTT_SSL_CMD) == 0)
            {
                mqtt_init_step += 1;
            }
            else if(strcmp(L506_cmd_info.cmd,L506_MQTT_CONFIG_CMD) == 0)
            {
                mqtt_init_step += 1;
            }
            else if(strcmp(L506_cmd_info.cmd,L506_MQTT_START_CMD) == 0)
            {
                mqtt_init_step += 1;
            }
            else if(strcmp(L506_cmd_info.cmd,L506_MQTT_CONNECT_CMD) == 0)
            {
                mqtt_init_step += 1;
            }
            else if(strcmp(L506_cmd_info.cmd,L506_MQTT_SUB_CMD) == 0)
            {
                //此处必须设置mqtt_init_step = MQTT_MAX_STEP，如果mqtt断开重新连接时，在连接过程中不能发送http指令，后面通过判断mqtt_init_step来判断是否正在重新连接mqtt
                mqtt_init_step = MQTT_MAX_STEP;
                mqtt_action = 0;             
                //L506_LOG("mqtt init sucess");
                if(is_queue_full(mqtt_action_res_queue) == QUEUE_FULL)
                {
                    //如果mqtt_action_res_queue队列满，则push一个
                    L506_LOG("mqtt_action_res_queue full,push one");
                    pos_end = OSQPend(mqtt_action_res_queue,10,&err);
                }
                
                mqtt_action_res.cmd = MQTT_INIT_ACTION;
                mqtt_action_res.result = MQTT_ACTION_SUCCESS;
                err = OSQPost(mqtt_action_res_queue,&mqtt_action_res);
                if(err != OS_ERR_NONE)
                {
                    L506_LOG("push msg to mqtt_action_res_queue fail");
                }                         
                mqtt_action = 0;
                
              
