herolizhen/YJIOT/FW/L506/stm32f103c8t6-l506/stm32f103c8t6-l506-https/user/user_L506/L506.c
            }
            else if(strcmp(L506_cmd_info.cmd,L506_MQTT_GET_STATUS_CMD) == 0)
            {
                pos = strstr(rx_buff,L506_MQTT_STATUS_START_FLAG);
                if(pos != NULL)
                {
                    pos = pos + strlen(L506_MQTT_STATUS_START_FLAG);
                    if(*pos == ASCII_SPACE)
                    {
                        pos += 1;
                    }
                    
                    pos_end = strstr(pos,"\r\n");
                    if(pos_end != NULL)
                    {
                        pos_end -= 1;
                        if(pos_end == pos)
                        {
                            if(is_queue_full(mqtt_action_res_queue) == QUEUE_FULL)
                            {
                                //如果mqtt_action_res_queue队列满，则push一个
                                L506_LOG("mqtt_action_res_queue full,push one");
                                pos_end = OSQPend(mqtt_action_res_queue,10,&err);
                            }
                            memset(L506_cmd_info.sendtring,0,strlen(L506_cmd_info.sendtring));
                            L506_cmd_info.sendtring[0] = *pos;
                            mqtt_action_res.status = (uint8_t)atoi(L506_cmd_info.sendtring);
                            mqtt_action_res.cmd = MQTT_GET_CONNECT_STATUS_ACTION;
                            mqtt_action_res.result = MQTT_ACTION_SUCCESS;
                            err = OSQPost(mqtt_action_res_queue,&mqtt_action_res);
                            if(err != OS_ERR_NONE)
                            {
                                L506_LOG("push msg to mqtt_action_res_queue fail");
                            }                         
                            mqtt_action = 0;
                        }
                    }
                }
            }
           
            
        }
        else if(L506_cmd_info.cmd_result == CMD_ERROR)
        {
            L506_cmd_info.error_times += 1;
            L506_cmd_info.Is_wait_data = 0;
            
            L506_LOG("%s",rx_buff);

          
            //按下组合键了，正在检测信号
            if(Is_signal_check == 1)
            {
                signal_check_err_times += 1;
            }
          
            if(Is_http == 1)
            {              
                L506_http_close();                
            }
          
          
            if(strcmp(L506_cmd_info.cmd,L506_ATI_CMD) == 0)
            {
                
            }
            else if(strcmp(L506_cmd_info.cmd,L506_CSQ_CMD) == 0)
            {     
                //获取信号质量             
                //printf("get signal quality error\r\n");
              
            }
            else if(strcmp(L506_cmd_info.cmd,L506_CICCID_CMD) == 0)
            {     
                //读取SIM 卡CCID          
                //printf("L506_QCCID_CMD error\r\n");
              
            }
            else if(strcmp(L506_cmd_info.cmd,L506_GSN_CMD) == 0)
            {
                //获取IMEI失败              
                //Is_Get_IMEI = 0;
            }
            else if(strcmp(L506_cmd_info.cmd,L506_QSPN_CMD) == 0)
            {     
                //读取SIM 卡服务运营商名称              
                //printf("L506_QSPN_CMD error\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPS_START_CMD) == 0)
            {   
                //printf("L506_HTTPS_START_CMD error\r\n");
              
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSPOSE_RES) == 0)
            {   
                //printf("L506_HTTPSPOSE_RES error\r\n");              
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSSEND_CMD) == 0)
            {   
                //printf("L506_HTTPSSEND_CMD error\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSRECV_CMD) == 0)
            {   
                //printf("L506_HTTPSRECV_CMD error\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSCLOSE_CMD) == 0)
            {   
                //printf("L506_HTTPSCLOSE_CMD error\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSSTOP_CMD) == 0)
            {   
                //printf("L506_HTTPSSTOP_CMD error\r\n");
                //如果发送http stop命令返回error，则可能模块内部出错，等待一段时间
               //OSTimeDlyHMSM(0,0,1,0);   
            }
            
            else if(strcmp(L506_cmd_info.cmd,L506_MQTT_SSL_CMD) == 0)
            {   

            }
            else if(strcmp(L506_cmd_info.cmd,L506_MQTT_CONFIG_CMD) == 0)
            {   

            }
            else if(strcmp(L506_cmd_info.cmd,L506_MQTT_START_CMD) == 0)
            {   
                //printf("L506_MQTT_START_CMD error\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_MQTT_CONNECT_CMD) == 0)
            {   
                //printf("L506_MQTT_START_CMD error\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_MQTT_SUB_CMD) == 0)
            {   
                //printf("L506_MQTT_START_CMD error\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_MQTT_CLOSE_CMD) == 0)
            {   
                //printf("L506_MQTT_START_CMD error\r\n");
            }
                    
            
            if(is_ota_check == 1 && is_L506_fogcloud_init == 0)
            {
                if(mqtt_init_step < MQTT_MAX_STEP)
                {
                    L506_mqtt_close();
                }
            
            }
            
          
        }
        else if(L506_cmd_info.cmd_result == CMD_TIMEOUT)
        {
            L506_LOG("%s",rx_buff);
          
            L506_cmd_info.timeout_times += 1;
            L506_cmd_info.Is_wait_data = 0;
          
            //按下组合键了，正在检测信号
            if(Is_signal_check == 1)
            {
                signal_check_err_times += 1;
            }
          
            if(Is_http == 1)
            {              
                L506_http_close();
            }
            
            if(strcmp(L506_cmd_info.cmd,L506_CSQ_CMD) == 0)
            {     
                //获取信号质量            
                //printf("get signal quality timeout\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_CICCID_CMD) == 0)
            {     
                //读取SIM 卡CCID            
                //printf("L506_QCCID_CMD timeout\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPS_START_CMD) == 0)
            {   
                //printf("L506_HTTPS_START_CMD error\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSPOSE_RES) == 0)
            {   
                //printf("L506_HTTPSPOSE_RES error\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSSEND_CMD) == 0)
            {   
                //printf("L506_HTTPSSEND_CMD error\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSRECV_CMD) == 0)
            {   
                //printf("L506_HTTPSRECV_CMD error\r\n");
            }
            else if(strcmp(L506_cmd_info.cmd,L506_HTTPSCLOSE_CMD) == 0)
            {   
                //printf("L506_HTTPSCLOSE_CMD error\r\n");
            }
              
            
