herolizhen/YJIOT/FW/L506/stm32f103c8t6-l506/stm32f103c8t6-l506-https/user/user_L506/L506.c
            if(is_ota_check == 1 && is_L506_fogcloud_init == 0)
            {
                if(mqtt_init_step < MQTT_MAX_STEP)
                {
                    L506_mqtt_close();
                }           
            }
            
        }
        
        //因为处理mqtt消息的函数在此函数的前面，所以有mqtt消息的话肯定已经处理了，把缓冲区清掉
        empty_rx_buff(rx_buff,index);
    }

}




void empty_rx_buff(char *rx_buff,uint16_t *index)
{
    if(rx_buff == NULL)
    {
        return;
    }
    memset(rx_buff,0,*index);
    //printf("index:%d\r\n",*index);
    *index = 0;
    
}



int L506_Send_data(unsigned char type,const char *cmd,const char *http_requeset,uint16_t http_requeset_length)
{
    int res = 0;
    char *pbuff = NULL;
  
    if(L506_cmd_info.Is_wait_data == 1)
    {
        res = L506_BUSY;
        goto exit;
    }
    
    if(type != CMD_TYPE && type != STRING_TYPE)
    {
        res = PARAMETER_ERROR;
        goto exit;
    }
    
    if(type > CMD_TYPE)
    {
        res = PARAMETER_ERROR;
        goto exit;
    }
    
    memset(L506_cmd_info.end_flag,0,sizeof(L506_cmd_info.end_flag));
  
    if(type == CMD_TYPE)
    { 
        pbuff = mymalloc(150);
        memset(pbuff,0,150);
      
        if(strcmp(cmd,L506_ATI_CMD) == 0)
        {
            strcpy(L506_cmd_info.end_flag,END_OK);
        }
        else if(strcmp(cmd,L506_DISABLE_CMD_ECHO_CMD) == 0)
        {
            sprintf(pbuff,"%s%s",L506_DISABLE_CMD_ECHO_CMD,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,END_OK);
        }
        else if(strcmp(cmd,L506_CSQ_CMD) == 0)
        {
            sprintf(pbuff,"%s%s",L506_CSQ_CMD,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,END_OK);
        }
        else if(strcmp(cmd,L506_GSN_CMD) == 0)
        {
            strcpy(L506_cmd_info.end_flag,END_OK);
        }
        else if(strcmp(cmd,L506_CICCID_CMD) == 0)
        {
            sprintf(pbuff,"%s%s",L506_CICCID_CMD,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,END_OK);
        }
        else if(strcmp(cmd,L506_QSPN_CMD) == 0)
        {
            strcpy(L506_cmd_info.end_flag,END_OK);
        }
        else if(strcmp(cmd,L506_HTTPS_START_CMD) == 0)     //https
        {
            sprintf(pbuff,"%s%s",L506_HTTPS_START_CMD,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_HTTPS_START_RES);
        }
        else if(strcmp(cmd,L506_HTTPSPOSE_CMD) == 0)    
        {
            sprintf(pbuff,"%s=%s,%d,2%s",L506_HTTPSPOSE_CMD,HTTPS_SERVER_ADDR,HTTPS_PORT,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_HTTPSPOSE_RES);
        }
        else if(strcmp(cmd,L506_HTTPSSEND_NZ_CMD) == 0)   
        {          
            sprintf(pbuff,"%s=%d%s",L506_HTTPSSEND_CMD,http_requeset_length,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_HTTPSSEND_NZ_RES);                
        }
        else if(strcmp(cmd,L506_HTTPS_SEND_REQUEST_CMD) == 0)   
        {
            //L506_HTTPS_SEND_REQUEST_CMD命令发送的是http请求的字符串，并不是真正的命令
            strcpy(L506_cmd_info.end_flag,L506_HTTPS_SEND_REQUEST_RES);                
        }
        else if(strcmp(cmd,L506_HTTPSSEND_Z_CMD) == 0)   
        {          
            sprintf(pbuff,"%s%s",L506_HTTPSSEND_CMD,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_HTTPSSEND_Z_RES);                
        }
        else if(strcmp(cmd,L506_HTTPSRECV_CMD) == 0)   
        {
            sprintf(pbuff,"%s=%d%s",L506_HTTPSRECV_CMD,UART_L506_RX_BUFF_SIZE,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_HTTPSRECV_RES);
        }
        else if(strcmp(cmd,L506_HTTPSCLOSE_CMD) == 0)   
        {
            sprintf(pbuff,"%s%s",L506_HTTPSCLOSE_CMD,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_HTTPSCLOSE_RES);
        }
        else if(strcmp(cmd,L506_HTTPSSTOP_CMD) == 0)   
        {
            sprintf(pbuff,"%s%s",L506_HTTPSSTOP_CMD,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_HTTPSSTOP_RES);
          
            if(https_req_res.http_body != NULL)
            {
                //printf("free send http_body\r\n");
                myfree(https_req_res.http_body);
                https_req_res.http_body = NULL;
            }
            
            if(https_req_res.header != NULL)
            {
                //printf("free http header\r\n");
                myfree(https_req_res.header);
                https_req_res.header = NULL;
            }
            
            if(https_req_res.jwt != NULL)
            {
                myfree(https_req_res.jwt);
                https_req_res.jwt = NULL;
            }
        }
        
        else if(strcmp(cmd,L506_MQTT_SSL_CMD) == 0)
        {
            sprintf(pbuff,"%s=0%s",L506_MQTT_SSL_CMD,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_MQTT_SSL_RES);
        }
        else if(strcmp(cmd,L506_MQTT_CONFIG_CMD) == 0)
        {
            sprintf(pbuff,"%s=%s,%s,%d%s",L506_MQTT_CONFIG_CMD,MQTT_CLIENT_ID,device_id,mqtt_passowrd,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_MQTT_CONFIG_RES);
        }
        else if(strcmp(cmd,L506_MQTT_START_CMD) == 0)
        {
            sprintf(pbuff,"%s=%s,%d%s",L506_MQTT_START_CMD,MQTT_SERVER_ADDR,MQTT_PORT,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_MQTT_START_RES);
        }
        else if(strcmp(cmd,L506_MQTT_CONNECT_CMD) == 0)
        {
            sprintf(pbuff,"%s=%d,%d%s",L506_MQTT_CONNECT_CMD,MQTT_CLEAN_SESSION,MQTT_KEEP_ALIVE_TIME,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_MQTT_CONNECT_RES);
        }
        else if(strcmp(cmd,L506_MQTT_SUB_CMD) == 0)
        {
            sprintf(pbuff,"%s=c2d/%s/commands,%d%s",L506_MQTT_SUB_CMD,device_id,MQTT_MESSAGE_QOS,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_MQTT_SUB_RES);
        }
        else if(strcmp(cmd,L506_MQTT_CLOSE_CMD) == 0)
        {
            sprintf(pbuff,"%s%s",L506_MQTT_CLOSE_CMD,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_MQTT_CLOSE_RES);
        }
        else if(strcmp(cmd,L506_MQTT_GET_STATUS_CMD) == 0)
        {
            sprintf(pbuff,"%s%s",L506_MQTT_GET_STATUS_CMD,L506_CMD_END_FLAG);
            strcpy(L506_cmd_info.end_flag,L506_MQTT_GET_STATUS_RES);
        }
    }
    else
    {
        strcpy(L506_cmd_info.end_flag,END_OK);
    }
     
    
    L506_cmd_info.cmd_result = CMD_WAIT;
    
    //L506_HTTSSTRING_CMD命令起始发送的是http请求的字符串，并不是真正的命令
    if(type == CMD_TYPE && strcmp(cmd,L506_HTTPS_SEND_REQUEST_CMD))
    {
       uart_L506_sendbytes((uint8_t *)pbuff,strlen(pbuff));
    }
    else 
    {
        uart_L506_sendbytes((uint8_t *)http_requeset,strlen(http_requeset));
    }
    
    
    L506_cmd_info.cmd_send_time = OSTimeGet();
    
    if(type == CMD_TYPE && strcmp(cmd,L506_HTTPS_SEND_REQUEST_CMD))
    {
        L506_LOG("%s",pbuff);
    }
    else 
    {
        L506_LOG("%s",http_requeset);
    }
    

    
  //此处需设置
    L506_cmd_info.Is_wait_data = 1;
    
    if(pbuff != NULL)
    {
        myfree(pbuff);
    }
    else
    {
        printf("pbuff == NULL\r\n");
    }
    
    //OSTimeDlyHMSM(0,0,0,300);   
    
    return L506_OK;
    
