herolizhen/YJIOT/FW/L506/stm32f103c8t6-l506/stm32f103c8t6-l506-https/user/user_L506/L506.c
exit:
    
    if(pbuff != NULL)
    {
        myfree(pbuff);
    }    

    return res;


}




//不知道什么原因，给模块发送数据的时候数据包不能太大，太大会导致模块处理不了，所以数据量大的时候分几部分发，每发送一部分要延时一会
//数据上传时，分3部分发送，第一部分是header,第二部分jwt部分，第三部分http_body部分
void L506_http_loop(void)
{
    INT8U err;
  
    //char *http_requeset = NULL;
    static uint16_t http_body_length = 0;
    uint16_t http_request_length = 0;
  
  
    if(Is_http == 0)
    {
        return;
    }
    
    
    if(L506_cmd_info.Is_wait_data == 1)
    {
        return;
    }
    
    memset(L506_cmd_info.cmd,0,sizeof(L506_cmd_info.cmd));
    
    if(https_step == 0)
    {
        //http open
        L506_cmd_info.type = CMD_TYPE;       
        strcpy(L506_cmd_info.cmd,L506_HTTPS_START_CMD);   

        https_req_res.upload_msg = OSQPend(upload_data_queue,10,&err);
        if(err != OS_ERR_NONE || https_req_res.upload_msg == NULL)
        {
            L506_LOG("http loop push msg fail");
            goto https_step0_error;
        }
        
        L506_action = https_req_res.upload_msg->action;
        save_http_session_id(https_req_res.upload_msg->http_id);
    }
    else if(https_step == 1)
    {
        L506_cmd_info.type = CMD_TYPE;       
        strcpy(L506_cmd_info.cmd,L506_HTTPSPOSE_CMD);    
    }
    else if(https_step == 2)
    {  
        //printf("malloc http header\r\n");
        https_req_res.header = mymalloc(HTTP_HEADER_LENGTH);
        if(https_req_res.header == NULL)
        {
            L506_LOG("http_request malloc fail");
            goto error;
        }
        memset(https_req_res.header,0,HTTP_HEADER_LENGTH);
        
        if(https_req_res.upload_msg->is_jwt == 1)
        {
            https_req_res.jwt = mymalloc(HTTP_JWT_LENGTH);
            if(https_req_res.jwt == NULL)
            {
                L506_LOG("jwt malloc fail");
                goto error;
            }
            memset(https_req_res.jwt,0,HTTP_JWT_LENGTH);
        }

        //printf("malloc send http_body\r\n");        
        https_req_res.http_body = mymalloc(HTTP_BODY_LENGTH);
        if(https_req_res.http_body == NULL)
        {
            L506_LOG("http_body malloc fail");
            goto error;
        }
        
        
        if(L506_BIT_CHECK(L506_action,HTTP_ACTIVATE))
        {
            mqtt_passowrd = OSTimeGet() % 10000;
            sprintf(https_req_res.header, "%s %s HTTP/1.1\r\n", HTTP_HEAD_METHOD_POST, FOG_V2_ACTIVATE_URI);
            sprintf(https_req_res.http_body,"{\"product_id\":\"%s\",\"mac\":\"%s\",\"devicepw\":\"%d\",\"mxchipsn\":\"%s\"}\r\n",PRODUCT_ID,ccid,mqtt_passowrd,MXCHIPSN);
        }
        if(L506_BIT_CHECK(L506_action,HTTP_TOKEN_AUTH))
        {
            sprintf(https_req_res.header, "%s %s HTTP/1.1\r\n", HTTP_HEAD_METHOD_POST, FOG_V2_GET_TOKEN_URI);
            sprintf(https_req_res.http_body,"{\"deviceid\":\"%s\",\"password\":\"%d\"}\r\n",device_id,mqtt_passowrd);
        }
        else if(L506_BIT_CHECK(L506_action,HTTP_OTA))
        {
            sprintf(https_req_res.header, "%s %s HTTP/1.1\r\n", HTTP_HEAD_METHOD_POST, FOG_V2_OTA_UP_DATA_URI);
            sprintf(https_req_res.http_body,"{\"product_id\":\"%s\",\"firmware_type\":\"%s\",\"modulename\":\"%s\",\"firmware\":\"%s\"}\r\n",PRODUCT_ID,IOT_VERSION,MODULE_NAME,FIRMWARE_VERSION);
        }
        else if(L506_BIT_CHECK(L506_action,HTTP_UPLOAD_DATA))
        {
            sprintf(https_req_res.header, "%s %s HTTP/1.1\r\n", HTTP_HEAD_METHOD_POST, FOG_V2_SEND_EVENT_URI);
            sprintf(https_req_res.http_body,"{\"deviceid\":\"%s\",\"devicepw\":\"%d\",\"payload\":\"{%s}\",\"format\":\"json\",\"flag\":%d}\r\n",device_id,mqtt_passowrd,https_req_res.upload_msg->payload,https_req_res.upload_msg->save_flag);
        
        }
        else if(L506_BIT_CHECK(L506_action,HTTP_C_CONFIRM))
        {
            sprintf(https_req_res.header, "%s %s HTTP/1.1\r\n", HTTP_HEAD_METHOD_POST, FOG_V2_CHIPS_CONFIRM_URI);
            sprintf(https_req_res.http_body,"{\"orderNo\":\"%s\",\"type\":\"1\",\"status\":\"2\",\"chips\":%d}\r\n",order_num,100);
        }
        else if(L506_BIT_CHECK(L506_action,HTTP_FACTORY_CHECK))
        {
            sprintf(https_req_res.header, "%s %s HTTP/1.1\r\n", HTTP_HEAD_METHOD_POST, FOG_V2_EXAM_UPLOAD_URI);
        }
        
        http_body_length = strlen(https_req_res.http_body);
        
        
        sprintf(https_req_res.header + strlen(https_req_res.header), "Host: %s\r\n", HTTPS_SERVER_ADDR);
        sprintf(https_req_res.header + strlen(https_req_res.header), "Content-Type: application/json;charset=UTF-8\r\n");
        sprintf(https_req_res.header + strlen(https_req_res.header), "Connection: Keepalive\r\n");
        
        if(https_req_res.upload_msg->is_jwt == 1)
        {
            sprintf(https_req_res.jwt, "Authorization: JWT %s\r\n\r\n", token_buff);
            http_request_length = strlen(https_req_res.header) + http_body_length + strlen(https_req_res.jwt);
        }
        else
        {
            strcat(https_req_res.header,L506_CMD_END_FLAG);
            http_request_length = strlen(https_req_res.header) + http_body_length;
        }
           
          
        L506_cmd_info.type = CMD_TYPE;       
        strcpy(L506_cmd_info.cmd,L506_HTTPSSEND_NZ_CMD); 
    }
    else if(https_step == 3)
    {
        uart_L506_sendbytes((uint8_t *)https_req_res.header,strlen(https_req_res.header));
        OSTimeDlyHMSM(0,0,0,20); 
        L506_LOG("%s",https_req_res.header);
        if(https_req_res.upload_msg->is_jwt == 1)
        {
            uart_L506_sendbytes((uint8_t *)https_req_res.jwt,strlen(https_req_res.jwt));
            OSTimeDlyHMSM(0,0,0,20); 
            L506_LOG("%s",https_req_res.jwt);
        }
        
      
        L506_cmd_info.type = CMD_TYPE;       
        strcpy(L506_cmd_info.cmd,L506_HTTPS_SEND_REQUEST_CMD);
    }
    else if(https_step == 4)
    {
        L506_cmd_info.type = CMD_TYPE;       
        strcpy(L506_cmd_info.cmd,L506_HTTPSSEND_Z_CMD);
    }
    else if(https_step == 5)
    {
        L506_cmd_info.type = CMD_TYPE;       
        strcpy(L506_cmd_info.cmd,L506_HTTPSRECV_CMD);
    }
    else if(https_step == 6)
    {
        L506_cmd_info.type = CMD_TYPE;       
        strcpy(L506_cmd_info.cmd,L506_HTTPSCLOSE_CMD);
    }
    else if(https_step == 7)
    {
        L506_cmd_info.type = CMD_TYPE;       
        strcpy(L506_cmd_info.cmd,L506_HTTPSSTOP_CMD);
    }

    
    //L506_Send_data(L506_cmd_info.type,L506_cmd_info.cmd,g_http_requeset,http_request_length);
    L506_Send_data(L506_cmd_info.type,L506_cmd_info.cmd,https_req_res.http_body,http_request_length);
    
    
    return;
    
    
error:

