herolizhen/YJIOT/FW/L506/stm32f103c8t6-l506/stm32f103c8t6-l506-https/user/user_L506/L506.c
    L506_LOG("http loop malloc fail");
    L506_http_close();
    return;
    
https_step0_error:
    
    Is_http = 0;
    

}


void L506_Get_Signal_Quality(void)
{
    //unsigned char res = 0;
  
    if(L506_cmd_info.Is_wait_data == 1 || Is_http == 1)
    {
        return;
    }
    
    memset(L506_cmd_info.cmd,0,sizeof(L506_cmd_info.cmd));
   
    L506_cmd_info.type = CMD_TYPE;      
    strcpy(L506_cmd_info.cmd,L506_CSQ_CMD);   
             
    L506_Send_data(L506_cmd_info.type,L506_cmd_info.cmd,NULL,0);

    //信号质量最大是99,如果数码管显示100则模块可能有问题
    signal_quality = 100;    
    
}

void L506_Disnable_Command_Echo(void)
{
    //unsigned char res = 0;
  
    if(L506_cmd_info.Is_wait_data == 1 || Is_http == 1)
    {
        return;
    }
    
    memset(L506_cmd_info.cmd,0,sizeof(L506_cmd_info.cmd));
   
    L506_cmd_info.type = CMD_TYPE;      
    strcpy(L506_cmd_info.cmd,L506_DISABLE_CMD_ECHO_CMD);   

    L506_Send_data(L506_cmd_info.type,L506_cmd_info.cmd,NULL,0);    
    
}

void L506_Get_CCID(void)
{
    //unsigned char res = 0;
  
    if(L506_cmd_info.Is_wait_data == 1 || Is_http == 1)
    {
        return;
    }
    
    memset(L506_cmd_info.cmd,0,sizeof(L506_cmd_info.cmd));
   
    L506_cmd_info.type = CMD_TYPE;      
    strcpy(L506_cmd_info.cmd,L506_CICCID_CMD);   

    L506_Send_data(L506_cmd_info.type,L506_cmd_info.cmd,NULL,0);    
    
}

void L506_http_close(void)
{   
    memset(L506_cmd_info.cmd,0,sizeof(L506_cmd_info.cmd));
   
    L506_cmd_info.type = CMD_TYPE;      
    strcpy(L506_cmd_info.cmd,L506_HTTPSSTOP_CMD);   

    L506_Send_data(L506_cmd_info.type,L506_cmd_info.cmd,NULL,0);  
   
    OSTimeDlyHMSM(0,0,5,0);

    L506_cmd_info.Is_wait_data = 0;
    Is_http = 0;
    https_step = 0;
    L506_action = 0;  
}


void L506_Event_Scan(void)
{  
    INT8U err = 0;
    mqtt_action_cmd_t *mqtt_action_cmd = NULL;
  
    if(L506_cmd_info.Is_wait_data == 1 || Is_http == 1 || mqtt_action != 0)
    {
        return;
    }

    if(!is_queue_empty(mqtt_action_cmd_queue))
    {
        mqtt_action_cmd = OSQPend(mqtt_action_cmd_queue,10,&err);
        if(err != OS_ERR_NONE || mqtt_action_cmd == NULL)
        {
            return;
        }
        
        if(mqtt_action_cmd->cmd == MQTT_INIT_ACTION)
        {
            mqtt_action = MQTT_INIT_ACTION; 
            mqtt_init_step = 0;
        }
        else if(mqtt_action_cmd->cmd == MQTT_GET_CONNECT_STATUS_ACTION)
        {
            mqtt_action = MQTT_GET_CONNECT_STATUS_ACTION; 
        }
        else
        {
            return;
        }

        
    }    
    //如果消息队列为空，则返回
    if(!is_queue_empty(upload_data_queue))
    {
        Is_http = 1; 
        https_step = 0;
        return;
    }    
   
}

int string_get_int(const char *string)
{
    unsigned char index_start = 0;
    unsigned char index_end = 0;
    unsigned char i = 0;

    //char buff[6] = {0};
  
    //查找字符串中的数字
    for(i = 0;i < 15;i ++)
    {
        if(*(string + i) == ASCII_COLONS)
        {
            if(*(string + i + 1) != ASCII_QUOTES)
            {
                index_start = i + 1;
            }
            else
            {
                index_start = i + 2;
            }
            
        }
        if(*(string + i) == ASCII_COMMA || *(string + i) == ASCII_BRANCE_CLOSE || *(string + i) == '\r')
        {
            if(*(string + i - 1) != ASCII_QUOTES)
            {
                index_end = i - 1;
            }
            else
            {
                index_end = i - 2;
            }
            
            break;
        }
    }
    
   
    if(index_end < index_start)
    {
       return -1; 
    }
    else
    {
        if(index_start == 0 || (index_end - index_start) > 5)
        {
            return -1;
        }
    }
     
    memset(L506_cmd_info.sendtring,0,strlen(L506_cmd_info.sendtring));
    strncpy(L506_cmd_info.sendtring,(string + index_start),(index_end - index_start + 1));
    
    
    return(atoi(L506_cmd_info.sendtring));

}

long string_get_long(const char *string)
{
    unsigned char index_start = 0;
    unsigned char index_end = 0;
    unsigned char i = 0;
  
    //char buff[6] = {0};
  
    for(i = 0;i < 15;i ++)
    {
        if(*(string + i) == ASCII_COLONS)
        {
            index_start = i + 1;
        }
        if(*(string + i) == ASCII_COMMA || *(string + i) == ASCII_BRANCE_CLOSE)
        {
            index_end = i - 1;
            break;
        }
    }
    
    if(index_end < index_start)
    {
       return -1; 
    }
    else
    {
        if((index_end - index_start) > 5)
        {
            return -1;
        }
    }
     
    memset(L506_cmd_info.sendtring,0,strlen(L506_cmd_info.sendtring));
    strncpy(L506_cmd_info.sendtring,(string + index_start),(index_end - index_start + 1));
    
    return(atol(L506_cmd_info.sendtring));

}


void string_get_string(const char *string,char *dest)
{
    //该函数中不要使用L506_cmd_info.string，ordernum复制到了该数组中
    unsigned char index_start = 0;
    unsigned char index_end = 0;
    unsigned char i = 0;

    for(i = 0;i < 50;i ++)
    {
        if(*(string + i) == ASCII_COLONS)
        {
            index_start = i + 2;
        }
        if(*(string + i) == ASCII_QUOTES && (*(string + i + 1) == ASCII_BRANCE_CLOSE || *(string + i + 1) == ASCII_COMMA))
        {
            index_end = i - 1;
            break;
        }
    }
    


    if(index_end < index_start || i == 50)
    {
        return;
    }
    else
    {
        if((index_end - index_start) > 40)
        {
            return;
        }
    }
    memset(dest,0,strlen(dest));
    strncpy(dest,(string + index_start),(index_end - index_start + 1));  

}


void Wifi_Led_On(void)
{
    if(wifi_led_state == 0)
    {
        //TM1620_LED_Control(LED_WIFI,LED_ON);
        wifi_led_state = 1;
    }
}

void Wifi_Led_Off(void)
{
    if(wifi_led_state == 1)
    {
        //TM1620_LED_Control(LED_WIFI,LED_OFF);
        wifi_led_state = 0;
    }
}

//检测L506是否出现通讯错误，如果一直错误或者超时则重启L506,L506通讯指示灯控制
//此函数不需要太频繁的执行
void L506_fogcloud_init_and_check(void)
{
    if((L506_cmd_info.error_times >= 20 || L506_cmd_info.timeout_times >= 3))
    {
        //重启L506       
        L506_Restart();
        
