herolizhen/YJIOT/FW/L506/stm32f103c8t6-l506/stm32f103c8t6-l506-https/user/user_L506/L506.c
    }
  
    if(L506_cmd_info.error_times != 0 || L506_cmd_info.timeout_times != 0 || Is_device_activate == 0)
    {
        if(wifi_led_state == 1)
        {
            //关闭wifi led
            Wifi_Led_Off();
        }
    }
    else if(L506_cmd_info.error_times == 0 && L506_cmd_info.timeout_times == 0 && Is_device_activate == 1)
    {
        if(wifi_led_state == 0)
        {
            //打开wifi led
            Wifi_Led_On();
        }
    }
    

//    if(L506_register_net.Is_L506_registerd == 1 && is_disabled_cmd_echo == 0)
//    {
//        L506_Disnable_Command_Echo();
//    }
    
    if(L506_register_net.Is_L506_registerd == 1 && Is_Get_CCID == 0)
    {
        L506_Get_CCID();
    }
    
    
//    if(Is_Get_CCID == 1 && Is_device_activate == 0)
//    {
//        L506_Device_Activate();
//    }
//    
//    if(is_get_token == 0 && Is_device_activate == 1)
//    {
//        L506_Device_Token_auth();
//    }
//    
//    if(is_ota_check == 0 && is_get_token == 1)
//    {
//        L506_Ota_Check();
//    }
//    if(is_ota_check == 1 && is_mqtt_init == 0)
//    {
//        L506_mqtt_init();
//    }
    
    
}



 
#define SIGNAL_CHECK_TIME_INTERVAL   61

void L506_signal_check(void)
{
    static unsigned char signal_check_stimes = 0;
    //记录检测了多长时间，单位是秒，暂定检测1分钟。如果检测时间长的话需要修改变量类型
    if(Is_signal_check == 0)
    {
        if(signal_check_stimes != 0)
        {
            signal_check_stimes = 0;
        }
        return;
    }
    
    signal_check_stimes += 1;
    
    //TM1620_DispalyData(2,signal_quality);
    
    L506_Get_Signal_Quality();
       
    if(signal_check_stimes >= SIGNAL_CHECK_TIME_INTERVAL)
    {
        Is_signal_check = 0;
    }   
}



void L506_mqtt_loop(void)
{
    //if(is_mqtt_init == 1 || is_ota_check == 0)
    if(L506_cmd_info.Is_wait_data == 1 || Is_http == 1 || mqtt_action == 0)
    {
        return;
    }
  
    if(mqtt_action == MQTT_INIT_ACTION)
    {
        if(is_mqtt_inited == 1)
        {
            return;
        }
        
        if(mqtt_init_step == 0)
        {
            L506_cmd_info.type = CMD_TYPE;       
            strcpy(L506_cmd_info.cmd,L506_MQTT_SSL_CMD);
        }
        else if(mqtt_init_step == 1)
        {
            L506_cmd_info.type = CMD_TYPE;       
            strcpy(L506_cmd_info.cmd,L506_MQTT_CONFIG_CMD);
        }
        else if(mqtt_init_step == 2)
        {
            L506_cmd_info.type = CMD_TYPE;       
            strcpy(L506_cmd_info.cmd,L506_MQTT_START_CMD);
        }
        else if(mqtt_init_step == 3)
        {
            L506_cmd_info.type = CMD_TYPE;       
            strcpy(L506_cmd_info.cmd,L506_MQTT_CONNECT_CMD);
        }
        else if(mqtt_init_step == 4)
        {
            L506_cmd_info.type = CMD_TYPE;       
            strcpy(L506_cmd_info.cmd,L506_MQTT_SUB_CMD);
        }
        
        L506_Send_data(L506_cmd_info.type,L506_cmd_info.cmd,NULL,0);
        
    }
    else if(mqtt_action == MQTT_GET_CONNECT_STATUS_ACTION)
    {
        L506_cmd_info.type = CMD_TYPE; 
        strcpy(L506_cmd_info.cmd,L506_MQTT_GET_STATUS_CMD);  
        L506_Send_data(L506_cmd_info.type,L506_cmd_info.cmd,NULL,0);      
    }    

}


void L506_get_mqtt_message(char *rx_buff,uint16_t *index)
{
    INT8U err;
    char *mqtt_start_pos = NULL;
    char *mqtt_stop_pos = NULL;
    char *payload_start_pos = NULL;
    char *payload_end_pos = NULL;
    uint16_t payload_length = 0;
  
    char *payload = NULL;
  
    if(is_mqtt_inited == 0 || rx_buff == NULL || *index == 0)
    {
        return;
    }
    
    mqtt_start_pos = strstr(rx_buff,MQTT_MSG_START_FLAG);
    if(mqtt_start_pos != NULL)
    {

        
        mqtt_stop_pos = strstr(mqtt_start_pos,MQTT_MSG_STOP_FLAG);
        if(mqtt_stop_pos != NULL)
        {
            payload_start_pos = strstr(mqtt_start_pos,MQTT_PAYLOAD_START_FLAG);
            if(payload_start_pos != NULL)
            {
                if(payload_start_pos > mqtt_stop_pos)
                {
                    goto exit;
                }
                              
                payload_start_pos += strlen(MQTT_PAYLOAD_START_FLAG);
                payload_end_pos = mqtt_stop_pos - 1;
                
                if(*payload_start_pos != '{' || *payload_end_pos != '}')
                {
                    goto exit;
                }
                
                payload_length = payload_end_pos - payload_start_pos + 1;
                
                if(payload_length > L506_PAYLOAD_MAX_LENGTH)
                {
                    //此条mqtt消息太长，废弃掉
                    L506_LOG("mqtt pyaload too long");
                    if(mqtt_start_pos == rx_buff && (mqtt_stop_pos + 2) == (rx_buff + *index))
                    {
                        empty_rx_buff(rx_buff,index);
                    }
                    else
                    {
                        *mqtt_start_pos = 'A';
                    }
                    
                    goto exit;
                }
                
                //如果消息队列满，先Push一个消息，并且把内存释放掉
                if(is_queue_full(mqtt_message_queue) == QUEUE_FULL)
                {
                    L506_LOG("mqtt queue full,push one message");
                    payload = OSQPend(mqtt_message_queue,10,&err);
                    if(err != OS_ERR_NONE)
                    {
                        L506_LOG("mqtt queue full,push one message fail\r\n");
                        return;
                    }
                    
                    //此处是否需要把从消息队列中Push出来的消息进行处理？？？？？？？？？？？？？
                    
                    //此处一定要释放掉从消息队列中获取的数据，否则内存会泄漏
                    myfree(payload);
                    payload = NULL;
                }
               
                //printf("malloc payload\r\n");
                payload = mymalloc(L506_PAYLAOD_BUFF_SIZE);
                if(payload == NULL)
                {
                    goto exit;
                }
                memset(payload,0,L506_PAYLAOD_BUFF_SIZE);
                
                strncpy(payload,payload_start_pos,payload_length);
                
