herolizhen/YJIOT/FW/L506/stm32f103c8t6-l506/stm32f103c8t6-l506-https/user/user_L506/L506.c
                //L506_LOG("payload_length=%d",payload_length);

                err = OSQPost(mqtt_message_queue,payload);
                if(err != OS_ERR_NONE)
                {
                    goto exit;
                }
                
                //printf("mqtt_start_pos:%p,rx_buff:%p\r\n",mqtt_start_pos,rx_buff);
                //printf("mqtt_stop_pos:%p,index:%p\r\n",mqtt_stop_pos + 2,rx_buff + *index);
                if(mqtt_start_pos == rx_buff && (mqtt_stop_pos + 2) == (rx_buff + *index))
                {
                    empty_rx_buff(rx_buff,index);
                    //printf("mqtt clean rx_buff\r\n");
                }
                else
                {
                    *mqtt_start_pos = 'A';
                    *mqtt_stop_pos = 'A';
                    *(payload_start_pos - strlen(MQTT_PAYLOAD_START_FLAG)) = 'A';
                }
                

            }

        }
    }
    
exit:
      if(payload != NULL)
      {
          myfree(payload);
          payload = NULL;
      } 

}


void L506_mqtt_close(void)
{
    if(L506_cmd_info.Is_wait_data == 1 || Is_http == 1)
    {
        return;
    }

    mymemset(L506_cmd_info.cmd,0,sizeof(L506_cmd_info.cmd));
   
    L506_cmd_info.type = CMD_TYPE;      
    strcpy(L506_cmd_info.cmd,L506_MQTT_CLOSE_CMD);   

    L506_Send_data(L506_cmd_info.type,L506_cmd_info.cmd,NULL,0);   
    
    is_mqtt_inited = 0;
    mqtt_action = 0;
    mqtt_init_step = 0;
    
    OSTimeDlyHMSM(0,0,5,0);   
}


void L506_get_mqtt_connect_status_cmd(void)
{
    if(is_mqtt_inited == 0 || L506_cmd_info.Is_wait_data == 1 || Is_http == 1)
    {
        return;
    }
    
    mymemset(L506_cmd_info.cmd,0,sizeof(L506_cmd_info.cmd));
    mymemset(L506_cmd_info.sendtring,0,strlen(L506_cmd_info.sendtring));
   
    L506_cmd_info.type = CMD_TYPE;      
    strcpy(L506_cmd_info.cmd,L506_MQTT_GET_STATUS_CMD);   

    L506_Send_data(L506_cmd_info.type,L506_cmd_info.cmd,NULL,0);     
}

void check_mqtt_status(void)
{
//    if(mqtt_connect_status == 0 && is_mqtt_inited == 1)
//    {
//        L506_mqtt_close();
//    }
}




static uint32_t generate_http_session_id(void)
{
    static uint32_t id = 1;

    return id ++;
}




uint8_t upload_data_event(const char *upload_data,uint8_t save_flag,upload_res_t *res_msg)
{
    INT8U err;
    uint8_t res = UPLOAD_SUCCESS;
    upload_data_msg_t upload_data_msg;
    upload_res_t *upload_res_msg = NULL;
    upload_data_msg_t *temp_msg = NULL;
    uint8_t try_times = 0;
    
    OSMutexPend(upload_data_mutex,0,&err);
  
https_start:
  
    if(upload_data == NULL)
    {
        res = UPLOAD_PARA_ERR;
        try_times = HTTPS_MAX_TRY_TIMES;
        goto exit;
    }
       
    memset(&upload_data_msg,0,sizeof(upload_data_msg));
    //memset(&upload_res_msg,0,sizeof(upload_res_msg));
    
    if(is_queue_full(upload_data_queue) == QUEUE_FULL)
    {
        //消息队列满了，push一个出来
        L506_LOG("upload upload queue full,push one msg");
        temp_msg = OSQPend(upload_data_queue,10,&err);
        if(err != OS_ERR_NONE)
        {
            res = UPLAOD_REQ_QUEUE_ERR;
            goto exit;
        }
        
        //push出来的消息队列必须要释放掉内存空间
        
        myfree(temp_msg->payload);
        temp_msg->payload = NULL;
    }
    
    upload_data_msg.http_id = generate_http_session_id();
    upload_data_msg.action = 0;
    upload_data_msg.action |= (1 << HTTP_UPLOAD_DATA);
    upload_data_msg.save_flag = save_flag;
    upload_data_msg.is_jwt = 1;
    upload_data_msg.payload = (char *)upload_data;
    
    err = OSQPost(upload_data_queue,&upload_data_msg);
    if(err != OS_ERR_NONE)
    {
        L506_LOG("push upload data msg error");
        res = UPLAOD_REQ_QUEUE_ERR;
        goto exit;
    }
    
    upload_res_msg = OSQPend(upload_res_queue,WAIT_HTTP_RES_MAX_TIME,&err);
    if(err != OS_ERR_NONE)
    {
        if(err == OS_ERR_TIMEOUT)
        {
            L506_LOG("upload data timeout");
            res = UPLOAD_TIMEOUT;
        }
        else
        {
            L506_LOG("push from upload res queue err:%d",err);
            res = err;
        }

        goto exit;
    }
    
    if(upload_res_msg == NULL)
    {
        L506_LOG("upload_res_msg == NULL");
        res = UPLOAD_RES_NULL;
        goto exit;
    }
    
    if(upload_res_msg->http_id != upload_data_msg.http_id)
    {
        L506_LOG("http_id error");
        res = UPLOAD_RES_ID_ERR;
        goto exit;
    }
    
    if(res_msg != NULL)
    {
        memcpy(res_msg,upload_res_msg,sizeof(upload_res_t)); 
        strcpy(res_msg->http_body,upload_res_msg->http_body);
    }

    res = UPLOAD_SUCCESS;
       
exit:
    if(upload_res_msg != NULL && upload_res_msg->http_body != NULL)
    {
        //printf("free res http_body\r\n");
        myfree(upload_res_msg->http_body);
        upload_res_msg->http_body = NULL;
        upload_res_msg = NULL;
    }
    
    try_times += 1;
    
    if(res != UPLOAD_SUCCESS && try_times < HTTPS_MAX_TRY_TIMES)
    {
        OSTimeDlyHMSM(0,0,2,0);
        goto https_start;
    }
    
    //延时10ms等待发送完http close和stop命令，然后再释放锁
    OSTimeDlyHMSM(0,0,0,10);
    
    OSMutexPost(upload_data_mutex);
    
    return res;

}




uint8_t device_activate_event(void)
{
    INT8U err;
    uint8_t res = UPLOAD_SUCCESS;
    upload_data_msg_t upload_data_msg;
    upload_res_t *upload_res_msg = NULL;
    upload_data_msg_t *temp_msg = NULL;
  
    cJSON *root = NULL;     
    cJSON *meta_item = NULL; 
    cJSON *code_item = NULL;  
    cJSON *data_item = NULL;  
    cJSON *deviceid_item = NULL; 
  
    int32_t code = 0;
    uint8_t try_times = 0;
  
    //这个锁锁住的资源比较多，时间可能会比较长
    OSMutexPend(upload_data_mutex,0,&err);
    
https_start:
  
    if(L506_register_net.Is_L506_registerd == 0 || Is_Get_CCID == 0)
    {
        res = MODULE_NOT_UP;
        try_times = HTTPS_MAX_TRY_TIMES;
        goto exit;
    }
   
    memset(&upload_data_msg,0,sizeof(upload_data_msg));
    
    if(is_queue_full(upload_data_queue) == QUEUE_FULL)
    {
        //消息队列满了，push一个出来
        L506_LOG("activate upload queue full,push one");
        temp_msg = OSQPend(upload_data_queue,10,&err);
        if(err != OS_ERR_NONE)
        {
            res = UPLAOD_REQ_QUEUE_ERR;
            goto exit;
        }
        
        //push出来的消息队列必须要释放掉内存空间
        if(temp_msg->payload != NULL)
        {
            myfree(temp_msg->payload);
            temp_msg->payload = NULL;
        }
    }
    
