herolizhen/YJIOT/FW/L506/stm32f103c8t6-l506/stm32f103c8t6-l506-https/user/user_L506/L506.c
    upload_data_msg.http_id = generate_http_session_id();
    upload_data_msg.action = 0;
    upload_data_msg.action |= (1 << HTTP_ACTIVATE);
    upload_data_msg.save_flag = 0;
    upload_data_msg.is_jwt = 0;
    upload_data_msg.payload = NULL;
    
    err = OSQPost(upload_data_queue,&upload_data_msg);
    if(err != OS_ERR_NONE)
    {
        L506_LOG("push upload data msg error");
        res = UPLAOD_REQ_QUEUE_ERR;
        goto exit;
    }
    
    L506_LOG("wait for activate");
    upload_res_msg = OSQPend(upload_res_queue,WAIT_HTTP_RES_MAX_TIME,&err);
    if(err != OS_ERR_NONE)
    {
        if(err == OS_ERR_TIMEOUT)
        {
            L506_LOG("device_activate timeout");
            res = UPLOAD_TIMEOUT;
        }
        else
        {
            L506_LOG("push from upload res queue err:%d",err);
            res = err;
        }

        goto exit;
    }
    
    if(upload_res_msg == NULL)
    {
        L506_LOG("upload_res_msg == NULL");
        res = UPLOAD_RES_NULL;
        goto exit;
    }
    
    if(upload_res_msg->http_id != upload_data_msg.http_id)
    {
        if(upload_res_msg->http_id == 0)
        {
          L506_LOG("res http id == 0");
        }
        else
        {
            L506_LOG("http_id error");
        }
        
        res = UPLOAD_RES_ID_ERR;
        goto exit;
    }
    
    
    //printf("%s\r\n",upload_res_msg->http_body);
    root = cJSON_Parse(upload_res_msg->http_body);
    if(root == NULL)
    {
        L506_LOG("json string formot error");
        res = JSON_ITEM_ERR;
        goto exit;
    }
    
    meta_item = cJSON_GetObjectItem(root,"meta");
    if(meta_item == NULL)
    {
        L506_LOG("not find meta_item");
        res = JSON_ITEM_ERR;
        goto exit;
    }
    
    code_item = cJSON_GetObjectItem(meta_item,"code");
    if(code_item == NULL)
    {
        L506_LOG("not find code item");
        res = JSON_ITEM_ERR;
        goto exit;
    }
    
    data_item = cJSON_GetObjectItem(root,"data");
    if(data_item == NULL)
    {
        L506_LOG("not find data_item");
        res = JSON_ITEM_ERR;
        goto exit;
    }
    
    deviceid_item = cJSON_GetObjectItem(data_item,"deviceid");
    if(deviceid_item == NULL)
    {
        L506_LOG("not find code item");
        res = JSON_ITEM_ERR;
        goto exit;
    }
       
    code = code_item->valueint;   
    if(code == 0)
    {
        Is_device_activate = 1;
        strcpy(device_id,deviceid_item->valuestring);
        L506_LOG("device_id:%s",device_id);
    }
    else
    {
        L506_LOG("code = %d",code);
    }
    
    res = UPLOAD_SUCCESS;
       
exit:
    
    if(deviceid_item != NULL)
    {
        cJSON_Delete(deviceid_item);
    }
    
    if(data_item != NULL)
    {
        cJSON_Delete(data_item);
    }
    
    if(code_item != NULL)
    {
        cJSON_Delete(code_item);
    }
    
    if(meta_item != NULL)
    {
        cJSON_Delete(meta_item);
    }
    
    if(root != NULL)
    {
        cJSON_Delete(root);
    }
    
      
    if(upload_res_msg != NULL && upload_res_msg->http_body != NULL)
    {
        //printf("free res http_body\r\n");
        myfree(upload_res_msg->http_body);       
        upload_res_msg->http_body = NULL;
        upload_res_msg = NULL;
    }
    
      
    try_times += 1;
    
    if(res != UPLOAD_SUCCESS && try_times < HTTPS_MAX_TRY_TIMES)
    {
        OSTimeDlyHMSM(0,0,5,0);
        goto https_start;
    }
    
    //延时10ms等待发送完http close和stop命令，然后再释放锁
    OSTimeDlyHMSM(0,0,0,10);
    
    
    OSMutexPost(upload_data_mutex);
    
    return res;

}



uint8_t device_get_token_event(void)
{
    INT8U err;
    uint8_t res = UPLOAD_SUCCESS;
    upload_data_msg_t upload_data_msg;
    upload_res_t *upload_res_msg = NULL;
    upload_data_msg_t *temp_msg = NULL;
  
    cJSON *root = NULL;     
    cJSON *meta_item = NULL; 
    cJSON *code_item = NULL;  
    cJSON *data_item = NULL;  
    cJSON *token_item = NULL; 
  
    int32_t code = 0;
    uint8_t try_times = 0;

      //这个锁锁住的资源比较多，时间可能会比较长
    OSMutexPend(upload_data_mutex,0,&err);
  
https_start:  
  
    if(L506_register_net.Is_L506_registerd == 0 || Is_Get_CCID == 0 || Is_device_activate == 0)
    {
        res = MODULE_NOT_UP;
        try_times = HTTPS_MAX_TRY_TIMES;
        goto exit;
    }
        
    memset(&upload_data_msg,0,sizeof(upload_data_msg));
    
    if(is_queue_full(upload_data_queue) == QUEUE_FULL)
    {
        //消息队列满了，push一个出来
        L506_LOG("token upload queue full,push one msg");
        temp_msg = OSQPend(upload_data_queue,10,&err);
        if(err != OS_ERR_NONE)
        {
            res = UPLAOD_REQ_QUEUE_ERR;
            goto exit;
        }
        
        //push出来的消息队列必须要释放掉内存空间
        if(temp_msg->payload != NULL)
        {
            myfree(temp_msg->payload);
            temp_msg->payload = NULL;
        }
    }
    
    upload_data_msg.http_id = generate_http_session_id();
    upload_data_msg.action = 0;
    upload_data_msg.action |= (1 << HTTP_TOKEN_AUTH);
    upload_data_msg.save_flag = 0;
    upload_data_msg.is_jwt = 0;
    upload_data_msg.payload = NULL;
    
    err = OSQPost(upload_data_queue,&upload_data_msg);
    if(err != OS_ERR_NONE)
    {
        L506_LOG("push upload data msg error");
        res = UPLAOD_REQ_QUEUE_ERR;
        goto exit;
    }
    
    L506_LOG("wait for get token");
    upload_res_msg = OSQPend(upload_res_queue,WAIT_HTTP_RES_MAX_TIME,&err);
    if(err != OS_ERR_NONE)
    {
        if(err == OS_ERR_TIMEOUT)
        {
            L506_LOG("device get token timeout");
            res = UPLOAD_TIMEOUT;
        }
        else
        {
            L506_LOG("push from upload res queue err:%d",err);
            res = err;
        }

        goto exit;
    }
    
    if(upload_res_msg == NULL)
    {
        L506_LOG("upload_res_msg == NULL");
        res = UPLOAD_RES_NULL;
        goto exit;
    }
    
    if(upload_res_msg->http_id != upload_data_msg.http_id)
    {
        if(upload_res_msg->http_id == 0)
        {
          L506_LOG("res http id == 0");
        }
        else
        {
            L506_LOG("http_id error");
        }
        res = UPLOAD_RES_ID_ERR;
        goto exit;
    }
    
    
    //printf("%s\r\n",upload_res_msg->http_body);
    root = cJSON_Parse(upload_res_msg->http_body);
    if(root == NULL)
    {
        L506_LOG("json string formot error");
        res = JSON_ITEM_ERR;
        goto exit;
    }
    
