herolizhen/YJIOT/FW/L506/stm32f103c8t6-l506/stm32f103c8t6-l506-https/user/user_L506/L506.c
exit:
    
    if(ota_file_item != NULL)
    {
        cJSON_Delete(ota_file_item);
    }
    
    if(ota_status_item != NULL)
    {
        cJSON_Delete(ota_status_item);
    }
    
    if(data_item != NULL)
    {
        cJSON_Delete(data_item);
    }
    
    if(code_item != NULL)
    {
        cJSON_Delete(code_item);
    }
    
    if(meta_item != NULL)
    {
        cJSON_Delete(meta_item);
    }
    
    if(root != NULL)
    {
        cJSON_Delete(root);
    }
      
    if(upload_res_msg != NULL && upload_res_msg->http_body != NULL)
    {
        myfree(upload_res_msg->http_body);
        upload_res_msg->http_body = NULL;
        upload_res_msg = NULL;
    }
      
    try_times += 1;
    
    if(res != UPLOAD_SUCCESS && try_times < HTTPS_MAX_TRY_TIMES)
    {
        OSTimeDlyHMSM(0,0,5,0);
        goto https_start;
    }
    
    
    //延时10ms等待发送完http close和stop命令，然后再释放锁
    OSTimeDlyHMSM(0,0,0,10);
    
    
    OSMutexPost(upload_data_mutex);
    
    return res;

}

uint8_t mqtt_init_event(void)
{
    INT8U err;
    uint8_t res = MQTT_ACTION_SUCCESS;
    mqtt_action_cmd_t mqtt_action_cmd_msg;
    mqtt_action_res_t *mqtt_action_res_msg = NULL;
    mqtt_action_cmd_t *temp_msg = NULL;
  
    uint8_t try_times = 0;

      //这个锁锁住的资源比较多，时间可能会比较长
    OSMutexPend(mqtt_cmd_mutex,0,&err);
  
mqtt_init_start:  
  
    if(L506_register_net.Is_L506_registerd == 0 || Is_Get_CCID == 0 || Is_device_activate == 0)
    {
        res = MODULE_NOT_UP;
        try_times = HTTPS_MAX_TRY_TIMES;
        goto exit;
    }
        
    memset(&mqtt_action_cmd_msg,0,sizeof(mqtt_action_cmd_msg));
    
    if(is_queue_full(mqtt_action_cmd_queue) == QUEUE_FULL)
    {
        //消息队列满了，push一个出来
        L506_LOG("mqtt init queue full,push one msg");
        temp_msg = OSQPend(mqtt_action_cmd_queue,10,&err);
        if(err != OS_ERR_NONE)
        {
            res = MQTT_CMD_QUEUE_ERR;
            goto exit;
        }
    }
    
    mqtt_action_cmd_msg.cmd = MQTT_INIT_ACTION;
    
    err = OSQPost(mqtt_action_cmd_queue,&mqtt_action_cmd_msg);
    if(err != OS_ERR_NONE)
    {
        L506_LOG("push mqtt init msg error");
        res = MQTT_CMD_QUEUE_ERR;
        goto exit;
    }
    
    L506_LOG("wait for mqtt init");
    mqtt_action_res_msg = OSQPend(mqtt_action_res_queue,WAIT_MQTT_INIT_RES_MAX_TIME,&err);
    if(err != OS_ERR_NONE)
    {
        if(err == OS_ERR_TIMEOUT)
        {
            L506_LOG("mqtt init timeout");
            res = MQTT_CMD_RES_TIMEOUT;
        }
        else
        {
            L506_LOG("push from mqtt cmd queue err:%d",err);
            res = err;
        }

        goto exit;
    }
    
    if(mqtt_action_res_msg == NULL)
    {
        L506_LOG("mqtt_action_res_msg == NULL");
        res = MQTT_CMD_RES_NULL;
        goto exit;
    }
    
    if(mqtt_action_res_msg->cmd != mqtt_action_cmd_msg.cmd)
    {
        L506_LOG("mqtt init res cmd err");
        goto exit;
    }
    
    if(mqtt_action_res_msg->result != MQTT_ACTION_SUCCESS)
    {
        L506_LOG("mqtt init cmd fail %d times",(try_times + 1));
        goto exit;
    }
    
    
    is_mqtt_inited = 1;
    is_L506_fogcloud_init = 1;
    
    L506_LOG("mqtt init success");
  
    res = MQTT_ACTION_SUCCESS;

    
       
exit:
      
      
    try_times += 1;
    
    if(res != MQTT_ACTION_SUCCESS && try_times < MQTT_INIT_TRY_MAX_TIME)
    {
        OSTimeDlyHMSM(0,0,5,0);
        goto mqtt_init_start;
    }
    
    
    OSMutexPost(mqtt_cmd_mutex);
    
    return res;

}



